## Terraform Plan

```
Acquiring state lock. This may take a few moments...
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.azs: Reading...
aws_route_table.public: Refreshing state... [id=rtb-0cdbb27a2a3412f64]
aws_security_group.k3s: Refreshing state... [id=sg-085440d2ce47e0c39]
data.aws_availability_zones.azs: Read complete after 1s [id=ap-southeast-1]
aws_subnet.public: Refreshing state... [id=subnet-0ae3747db1aaefebd]
aws_subnet.private: Refreshing state... [id=subnet-0514f816da0e430a0]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-068fa44414437f3f7]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]
aws_instance.k3s: Refreshing state... [id=i-0a9fe2685bc51e784]
aws_eip.k3s: Refreshing state... [id=eipalloc-09acd165292cc8788]
local_file.ansible_inventory: Refreshing state... [id=35fac3ab1eb3faf43f6ef902e08ed58e1b52c6c9]
null_resource.wait_ssh: Refreshing state... [id=365215023281443318]
null_resource.show_pwd: Refreshing state... [id=2923969834001703611]
null_resource.ansible: Refreshing state... [id=3800611308858957684]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            [masters]
            18.140.49.89 ansible_user=ubuntu
            
            [workers]
            
            [all:vars]
            ansible_ssh_private_key_file=/home/runner/work/ceramicraft-iac/ceramicraft-iac/k3s/github-ec2.pem
            ansible_python_interpreter=/usr/bin/python3
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ansible/inventory.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```